app/controllers/events_controller.rb

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 8)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("evdate", "created_at", "evtype", "updated_at", "evname", "evtrack", "evhostreg", "evchief") VALUES('2011-03-19', '2011-02-08 03:43:48', 'F&C Training', '2011-02-08 03:43:48', 'Crash & Burn School', 'PPIR', 'CDR', '-NA-')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 8)
UPDATE "events" SET "updated_at" = '2011-02-08 03:52:41', "evdate" = '2011-08-06' WHERE "id" = 8